wiki/js.org
#+TITLE:       javascript
#+AUTHOR:      Will Chang
#+EMAIL:       changwei.cn@gmail.com
#+DATE:        2013-12-19 Thu
#+URI:         /wiki/html/js
#+KEYWORDS:    js
#+TAGS:        :js:jquery:dojo:ajax:定位元素:调试:piwik:网站统计:
#+LANGUAGE:    en
#+OPTIONS:     H:3 num:nil toc:nil \n:nil ::t |:t ^:nil -:nil f:t *:t <:t
#+DESCRIPTION:  Javascript


 - [[http://www.myexception.cn/javascript/407684.html][DOJO js 根本dom操作]]
 - http://folyred.iteye.com/blog/946565
 - https://dojotoolkit.org/reference-guide/1.7/dojo/dom-construct.html
 - [[http://jinlong.github.io/blog/2013/08/29/devtoolsecrets/][浏览器开发工具的秘密]]
 - [[http://www.cnblogs.com/wukenaihe/archive/2013/01/27/javascript%E8%B0%83%E8%AF%95.html][Chrome developer tool介绍（javascript调试）]]
 - [[http://www.jb51.net/article/18111.htm][jquery控制div下所有连接]]
 - [[https://micate.me/debug-jquery-object-binded-events.note][获取绑定在 jQuery 对象上的事件]]
 - [[http://www.divcss5.com/jiqiao/j497.shtml][jQuery适用技巧笔记整合]]
 - [[http://kelvinh.github.io/blog/2011/12/17/jquery-ajax-request-and-struts2-ognl-error/][jQuery发送含有数组参数的ajax请求以及后台Struts2的OGNL解析错误]]

*  [[http://www.w3cschool.cc/bootstrap/bootstrap-intro.html][Bootstrap 简介]]

  - [[https://wrapbootstrap.com/][Theme and temaplate]]
  - http://reactiveraven.github.io/jqBootstrapValidation/
Bootstrap 是一个用于快速开发 Web 应用程序和网站的前端框架。

在现代 Web 开发中，有几个几乎所有的 Web 项目中都需要的组件。

Bootstrap 为您提供了所有这些基本的模块 - Grid、Typography、Tables、Forms、Buttons 和 Responsiveness。

此外，还有大量其他有用的前端组件，比如 Dropdowns、Navigation、Modals、Typehead、Pagination、Carousal、Breadcrumb、Tab、Thumbnails、Headers 等等。

有了这些，你可以搭建一个 Web 项目，并让它运行地更快速更轻松。

* UI调试工具Fiddler,微软开发的。
* 获得jquery绑定的事件an


#+BEGIN_SRC javascript

var events = $(".add").data('events');
if (events && events.click) {



    // jQuery 1.4.x+
    $.each(events.click, function(key, handlerObject) {
        console.info(handlerObject.handler);
    });
}

#+END_SRC


* $.ajax 在IE中不work

#+BEGIN_SRC javascript
        $.ajaxSetup ({
            cache: false //关闭AJAX相应的缓存
        });

#+END_SRC

* firebug
 - [[http://mynoteweb.com/node/114][用Firebug调试JavaScript]]

* Jquery 查询对象的几种方式

  | 查询方式                 | 例子                                          |
  | 按class查询              | $(".myclass")                                 |
  | 按ID查询                 | $("#myid")                                    |
  | 定位某个元素，查找子元素 | $(".quickMenu i").bind('click', function () { |
  | 函数里获得this的子元素   | $(this).find('i').toggleClass("ticked");      |
  |                          |                                               |


* Jquery widget 编写

 1. http://bililite.com/blog/understanding-jquery-ui-widgets-a-tutorial/

#+BEGIN_SRC javascript


var Green5  = {
        getLevel: function () { return this.options.level; },
        setLevel: function (x) {
                var greenlevels = this.options.greenlevels;
                var level = Math.floor(Math.min(greenlevels.length-1, Math.max(0,x)));
                this.options.level = level;
                this.element.css({background: greenlevels[level]});
                this._trigger('change', 0, level);
        },
        _init: function() { this.setLevel(this.getLevel()); }, // grab the default value and use it
        darker: function() { this.setLevel(this.getLevel()-1); },
        lighter: function() { this.setLevel(this.getLevel()+1); },
        off: function() {
                this.element.css({background: 'none'});
                this._trigger('done');
                this.destroy(); // use the predefined function
        },
        options: {
                level: 15,
                greenlevels: ['#000','#010','#020','#030','#040','#050','#060','#070','#080','#090','#0a0','#0b0','#0c0','#0d0','#0e0','#0f0', '#fff']
        }
};
$.widget("ui.green5", Green5);
#+END_SRC

#+BEGIN_SRC html
        <p class="target">This is a test paragraph with green level <span class="level">undefined</span>.</p>
#+END_SRC
#+BEGIN_SRC javascript

//  The on button above does the following:
$('.target').green5({
        change: function(event, level) { $('.level', this).text(level); } // callback to handle change event
});
$('.target').bind('green5done', function() { $('.level', this).text('undefined');alert('bye!') }); // event handler for done event

#+END_SRC

