wiki/html/js/index.html
<!DOCTYPE html>
<html lang="en-us">
<head>
  <title>javascript - Keep going</title>
  <meta charset="utf-8" />
  <meta name="author" content="Will Chang" />
    <meta name="description" content="Javascript" />
    <meta name="keywords" content="js" />

  <link rel="stylesheet" href="http://standino.github.io/media/css/main.css" type="text/css">
  <link rel="stylesheet" href="http://standino.github.io/media/css/prettify.css" type="text/css">

  <link rel="stylesheet" href="/media/css/prettify.css" type="text/css">
  <link rel="stylesheet" href="/media/css/main.css" type="text/css">

  <link rel="stylesheet" href="../../../media/css/main.css" type="text/css">
  <link rel="stylesheet" href="../../../media/css/prettify.css" type="text/css">

</head>
  <body class="container">
    <div>
      <header class="masthead">
        <h1 class="masthead-title"><a href="/">Keep going</a></h1>
        <p>努力超越自己！</p>
        <ul>
          <li><a href="/blog/">Blog</a></li>
          <li><a href="/html/">Html</a></li>
          <li><a href="/media/">Media</a></li>
          <li><a href="/tags/">Tags</a></li>
          <li><a href="/wiki/">Wiki</a></li>
          <li><a href="/tags/">Tags</a></li>
          <li><a href="/about/">About</a></li>
          <li><a href="https://github.com/standino">GitHub</a></li>
          <li><a href="/rss.xml">RSS</a></li>
        </ul>
        <form method="get" id="searchform" action="http://www.google.com/search">
          <input type="text" class="field" name="q" id="s" placeholder="Search">
          <input type="hidden" name="q" value="site:standino.github.io">
        </form>
      </header>
    </div>

<div>
<div class="post">
<h1>javascript</h1>
<ul class="org-ul">
<li><a href="http://www.myexception.cn/javascript/407684.html">DOJO js 根本dom操作</a>
</li>
<li><a href="http://folyred.iteye.com/blog/946565">http://folyred.iteye.com/blog/946565</a>
</li>
<li><a href="https://dojotoolkit.org/reference-guide/1.7/dojo/dom-construct.html">https://dojotoolkit.org/reference-guide/1.7/dojo/dom-construct.html</a>
</li>
<li><a href="http://jinlong.github.io/blog/2013/08/29/devtoolsecrets/">浏览器开发工具的秘密</a>
</li>
<li><a href="http://www.cnblogs.com/wukenaihe/archive/2013/01/27/javascript%E8%B0%83%E8%AF%95.html">Chrome developer tool介绍（javascript调试）</a>
</li>
<li><a href="http://www.jb51.net/article/18111.htm">jquery控制div下所有连接</a>
</li>
<li><a href="https://micate.me/debug-jquery-object-binded-events.note">获取绑定在 jQuery 对象上的事件</a>
</li>
<li><a href="http://www.divcss5.com/jiqiao/j497.shtml">jQuery适用技巧笔记整合</a>
</li>
<li><a href="http://kelvinh.github.io/blog/2011/12/17/jquery-ajax-request-and-struts2-ognl-error/">jQuery发送含有数组参数的ajax请求以及后台Struts2的OGNL解析错误</a>
</li>
</ul>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><a href="http://www.w3cschool.cc/bootstrap/bootstrap-intro.html">Bootstrap 简介</a></h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li><a href="https://wrapbootstrap.com/">Theme and temaplate</a>
</li>
<li><a href="http://reactiveraven.github.io/jqBootstrapValidation/">http://reactiveraven.github.io/jqBootstrapValidation/</a>
</li>
</ul>
<p>
Bootstrap 是一个用于快速开发 Web 应用程序和网站的前端框架。
</p>

<p>
在现代 Web 开发中，有几个几乎所有的 Web 项目中都需要的组件。
</p>

<p>
Bootstrap 为您提供了所有这些基本的模块 - Grid、Typography、Tables、Forms、Buttons 和 Responsiveness。
</p>

<p>
此外，还有大量其他有用的前端组件，比如 Dropdowns、Navigation、Modals、Typehead、Pagination、Carousal、Breadcrumb、Tab、Thumbnails、Headers 等等。
</p>

<p>
有了这些，你可以搭建一个 Web 项目，并让它运行地更快速更轻松。
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">UI调试工具Fiddler,微软开发的。</h2>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">获得jquery绑定的事件an</h2>
<div class="outline-text-2" id="text-3">
<div class="org-src-container">

<pre class="src src-javascript">var events = $(".add").data('events');
if (events &amp;&amp; events.click) {



    // jQuery 1.4.x+
    $.each(events.click, function(key, handlerObject) {
        console.info(handlerObject.handler);
    });
}
</pre>
</div>
</div>
</div>


<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">$.ajax 在IE中不work</h2>
<div class="outline-text-2" id="text-4">
<div class="org-src-container">

<pre class="src src-javascript">$.ajaxSetup ({
    cache: false //关闭AJAX相应的缓存
});
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5">firebug</h2>
<div class="outline-text-2" id="text-5">
<ul class="org-ul">
<li><a href="http://mynoteweb.com/node/114">用Firebug调试JavaScript</a>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6">Jquery 查询对象的几种方式</h2>
<div class="outline-text-2" id="text-6">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<tbody>
<tr>
<td class="left">查询方式</td>
<td class="left">例子</td>
</tr>

<tr>
<td class="left">按class查询</td>
<td class="left">$(".myclass")</td>
</tr>

<tr>
<td class="left">按ID查询</td>
<td class="left">$("#myid")</td>
</tr>

<tr>
<td class="left">定位某个元素，查找子元素</td>
<td class="left">$(".quickMenu i").bind('click', function () {</td>
</tr>

<tr>
<td class="left">函数里获得this的子元素</td>
<td class="left">$(this).find('i').toggleClass("ticked");</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>


<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7">Jquery widget 编写</h2>
<div class="outline-text-2" id="text-7">
<ol class="org-ol">
<li><a href="http://bililite.com/blog/understanding-jquery-ui-widgets-a-tutorial/">http://bililite.com/blog/understanding-jquery-ui-widgets-a-tutorial/</a>
</li>
</ol>

<div class="org-src-container">

<pre class="src src-javascript">var Green5  = {
        getLevel: function () { return this.options.level; },
        setLevel: function (x) {
                var greenlevels = this.options.greenlevels;
                var level = Math.floor(Math.min(greenlevels.length-1, Math.max(0,x)));
                this.options.level = level;
                this.element.css({background: greenlevels[level]});
                this._trigger('change', 0, level);
        },
        _init: function() { this.setLevel(this.getLevel()); }, // grab the default value and use it
        darker: function() { this.setLevel(this.getLevel()-1); },
        lighter: function() { this.setLevel(this.getLevel()+1); },
        off: function() {
                this.element.css({background: 'none'});
                this._trigger('done');
                this.destroy(); // use the predefined function
        },
        options: {
                level: 15,
                greenlevels: ['#000','#010','#020','#030','#040','#050','#060','#070','#080','#090','#0a0','#0b0','#0c0','#0d0','#0e0','#0f0', '#fff']
        }
};
$.widget("ui.green5", Green5);
</pre>
</div>

<div class="org-src-container">

<pre class="src src-html">&lt;p class="target"&gt;This is a test paragraph with green level &lt;span class="level"&gt;undefined&lt;/span&gt;.&lt;/p&gt;
</pre>
</div>
<div class="org-src-container">

<pre class="src src-javascript">//  The on button above does the following:
$('.target').green5({
        change: function(event, level) { $('.level', this).text(level); } // callback to handle change event
});
$('.target').bind('green5done', function() { $('.level', this).text('undefined');alert('bye!') }); // event handler for done event
</pre>
</div>
</div>
