wiki/js.org
** Involving the Mouse
Now, a lot of what we want to do with widgets involves mouse tracking, so ui.core.js provides a mixin object that includes lots of
useful methods for the mouse. All we need to do is add the $.ui.mouse widget to our widget prototype:

#+BEGIN_SRC javascript


var Green6 = {mouse-overriding function and widget-specific functions};
$.widget ('ui.green6', $.ui.mouse, Green6);
#+END_SRC
And override $.ui.mouse's functions (_mouseStart, _mouseDrag, _mouseStop) to do something useful, and call this._mouseInit in your
this._init and this._mouseDestroy in your this.destroy. The mouse defaults are automagically including in your options object; see
the mouse code for details.

Let's add some mouse control to our greenerizer:
#+BEGIN_SRC javascript



Green6 = $.extend({}, $.ui.green5.prototype, { // leave the old Green5 alone; create a new object
        _init: function(){
                $.ui.green5.prototype._init.call(this); // call the original function
                this._mouseInit(); // start up the mouse handling
        },
        destroy: function(){
                this._mouseDestroy();
                $.ui.green5.prototype.destroy.call(this); // call the original function
        },
        // need to override the mouse functions
        _mouseStart: function(e){
                // keep track of where the mouse started
                this.xStart = e.pageX; // not in the options object; this is not something that can be initialized by the user
                this.levelStart = this.options.level;
        },
        _mouseDrag: function(e){
                this.setLevel (this.levelStart +(e.pageX-this.xStart)/this.options.distance);
        },
        options: {
                level: 15,
                greenlevels: ['#000','#010','#020','#030','#040','#050','#060','#070','#080','#090','#0a0','#0b0','#0c0','#0d0','#0e0','#0f0', '#fff'],
                distance: 10
        }
});
$.widget("ui.green6", $.ui.mouse, Green6);
#+END_SRC

#+BEGIN_SRC html


        <p class="target">This is a test paragraph with green level <span class="level">undefined</span>.</p>
#+END_SRC

The ever-alert reader will note what we've just done: subclassed green5 to make green6, including calls to "super" methods. This
ought to be abstracted out into its own method, something like

#+BEGIN_SRC javascript


$.ui.green5.subclass("green6", $.ui.mouse, {mouseStart:function(){}, mouseDrag: function(){}})
#+END_SRC

* piwik

 API: http://developer.piwik.org/api-reference/tracking-javascript#where-can-i-find-the-piwik-tracking-code

* [[http://www.bootcss.com/][Bootstrap]]

* SSI

  http://blog.csdn.net/cpp_lzth/article/details/6167591

* Node.js
  1. 在Windows下安装Node.js、npm、express http://blog.uifanr.com/2013/03/12/472
** [[http://getkickstrap.com/docs.html#/first-steps][kickstrap]]


  https://www.firebase.com/tutorial/#session/va7gdy2y5s0

* ajax 乱码
encodeURIComponent(

#+BEGIN_SRC


  $.ajax({
    url: "/contact/list?keyword="+encodeURIComponent(keyword)+"&pageNum="+page,
    dataType : "json",
    success : function(data) {
#+END_SRC

* 表格截断
 1. http://www.045d.com/post/461.html
 2. http://www.cftea.com/c/2010/12/UVBUCD0J888L2XPQ.asp

《
       .notice-td { overflow:hidden;white-space:nowrap;word-break:keep-all;  }
       
* autocompte

http://jqueryui.com/autocomplete/#multiple-remote
* min js
  - http://yui.github.io/yuicompressor/
  - https://github.com/yui/yuicompressor/releases

#+BEGIN_SRC 

java -jar yuicompressor-x.y.z.jar myfile.js -o myfile-min.js
java -jar /home/will/JD/tools/yuicompressor-2.4.8.jar  jquery.portlet.js -o  jquery.portlet.min.js

java -jar /home/will/JD/tools/yuicompressor-2.4.8.jar  jquery.portlet.js -o  jquery.portlet.pack.js

#+END_SRC

* Node js

 - http://www.nodebeginner.org/index-zh-cn.html

* [[https://angularjs.org/][Angular]] + meteor

通过阅读文章好像Angular更好一些

 1. http://www.csdn.net/article/2013-09-09/2816880-angular-ember-javascript-frameworks
 2. http://blog.jobbole.com/46779/
 3. http://zouyesheng.com/angular.html
 4. http://emberjs.com/
 5. http://www.cnblogs.com/rush/archive/2013/04/29/3051191.html
 6. http://angularjs.org/
 7. http://developer.51cto.com/art/201308/406932_all.htm
 8. http://www.ng-newsletter.com/posts/beginner2expert-how_to_start.html
 9. http://docs.meteor.com/#livehtmltemplates
 10. https://github.com/angular-ui/ui-sortable
 11. http://angular-ui.github.io/ng-grid/
 12. https://github.com/angular-ui/ng-grid
 13. https://github.com/JimLiu/angular-ui-tree
 14. https://github.com/search?p=3&q=angular-ui&ref=cmdform&type=Repositories
 15. http://angular-ui.github.io/bootstrap/
 16. http://www.csdn.net/article/2013-03-14/2814486-Meteor-Web-App
 17. http://angular-ui.github.io/
 18. [[http://www.infoq.com/cn/news/2014/05/angularjs-front-end-architecture?utm_campaign=infoq_content&utm_source=infoq&utm_medium=feed&utm_term=global][基于AngularJS的企业软件前端架构]]

**Portal 
 1. https://github.com/nickholub/angular-ui-dashboard
 2. http://nickholub.github.io/angular-dashboard-app/#/
 3. https://github.com/flamejs/flame.js
 4. JQuery UI - sortable 排序插件参数详解 http://www.cnblogs.com/yoyogehei/archive/2011/07/28/2119910.html
 5. http://www.hongkiat.com/blog/jquery-ui-sortable/
 6. AngularJS入门教程 http://www.ituring.com.cn/minibook/303
 7. [[http://blog.pusher.com/making-angular-js-realtime-with-pusher/][Making Angular.js realtime with Websockets]]

