wiki/html/js/index.html

<div id="outline-container-sec-7-1" class="outline-3">
<h3 id="sec-7-1">Involving the Mouse</h3>
<div class="outline-text-3" id="text-7-1">
<p>
Now, a lot of what we want to do with widgets involves mouse tracking, so ui.core.js provides a mixin object that includes lots of
useful methods for the mouse. All we need to do is add the $.ui.mouse widget to our widget prototype:
</p>

<div class="org-src-container">

<pre class="src src-javascript">var Green6 = {mouse-overriding function and widget-specific functions};
$.widget ('ui.green6', $.ui.mouse, Green6);
</pre>
</div>
<p>
And override $.ui.mouse's functions (_mouseStart, _mouseDrag, _mouseStop) to do something useful, and call this._mouseInit in your
this._init and this._mouseDestroy in your this.destroy. The mouse defaults are automagically including in your options object; see
the mouse code for details.
</p>

<p>
Let's add some mouse control to our greenerizer:
</p>
<div class="org-src-container">

<pre class="src src-javascript">Green6 = $.extend({}, $.ui.green5.prototype, { // leave the old Green5 alone; create a new object
        _init: function(){
                $.ui.green5.prototype._init.call(this); // call the original function
                this._mouseInit(); // start up the mouse handling
        },
        destroy: function(){
                this._mouseDestroy();
                $.ui.green5.prototype.destroy.call(this); // call the original function
        },
        // need to override the mouse functions
        _mouseStart: function(e){
                // keep track of where the mouse started
                this.xStart = e.pageX; // not in the options object; this is not something that can be initialized by the user
                this.levelStart = this.options.level;
        },
        _mouseDrag: function(e){
                this.setLevel (this.levelStart +(e.pageX-this.xStart)/this.options.distance);
        },
        options: {
                level: 15,
                greenlevels: ['#000','#010','#020','#030','#040','#050','#060','#070','#080','#090','#0a0','#0b0','#0c0','#0d0','#0e0','#0f0', '#fff'],
                distance: 10
        }
});
$.widget("ui.green6", $.ui.mouse, Green6);
</pre>
</div>

<div class="org-src-container">

<pre class="src src-html">&lt;p class="target"&gt;This is a test paragraph with green level &lt;span class="level"&gt;undefined&lt;/span&gt;.&lt;/p&gt;
</pre>
</div>

<p>
The ever-alert reader will note what we've just done: subclassed green5 to make green6, including calls to "super" methods. This
ought to be abstracted out into its own method, something like
</p>

<div class="org-src-container">

<pre class="src src-javascript">$.ui.green5.subclass("green6", $.ui.mouse, {mouseStart:function(){}, mouseDrag: function(){}})
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8">piwik</h2>
<div class="outline-text-2" id="text-8">
<p>
API: <a href="http://developer.piwik.org/api-reference/tracking-javascript#where-can-i-find-the-piwik-tracking-code">http://developer.piwik.org/api-reference/tracking-javascript#where-can-i-find-the-piwik-tracking-code</a>
</p>
</div>
</div>

<div id="outline-container-sec-9" class="outline-2">
<h2 id="sec-9"><a href="http://www.bootcss.com/">Bootstrap</a></h2>
</div>

<div id="outline-container-sec-10" class="outline-2">
<h2 id="sec-10">SSI</h2>
<div class="outline-text-2" id="text-10">
<p>
<a href="http://blog.csdn.net/cpp_lzth/article/details/6167591">http://blog.csdn.net/cpp_lzth/article/details/6167591</a>
</p>
</div>
</div>

<div id="outline-container-sec-11" class="outline-2">
<h2 id="sec-11">Node.js</h2>
<div class="outline-text-2" id="text-11">
<ol class="org-ol">
<li>在Windows下安装Node.js、npm、express <a href="http://blog.uifanr.com/2013/03/12/472">http://blog.uifanr.com/2013/03/12/472</a>
</li>
</ol>
</div>
<div id="outline-container-sec-11-1" class="outline-3">
<h3 id="sec-11-1"><a href="http://getkickstrap.com/docs.html#/first-steps">kickstrap</a></h3>
<div class="outline-text-3" id="text-11-1">
<p>
<a href="https://www.firebase.com/tutorial/#session/va7gdy2y5s0">https://www.firebase.com/tutorial/#session/va7gdy2y5s0</a>
</p>
</div>
</div>
</div>

<div id="outline-container-sec-12" class="outline-2">
<h2 id="sec-12">ajax 乱码</h2>
<div class="outline-text-2" id="text-12">
<p>
encodeURIComponent(
</p>

<pre class="example">
$.ajax({
  url: "/contact/list?keyword="+encodeURIComponent(keyword)+"&amp;pageNum="+page,
  dataType : "json",
  success : function(data) {
</pre>
</div>
</div>

<div id="outline-container-sec-13" class="outline-2">
<h2 id="sec-13">表格截断</h2>
<div class="outline-text-2" id="text-13">
<ol class="org-ol">
<li><a href="http://www.045d.com/post/461.html">http://www.045d.com/post/461.html</a>
</li>
<li><a href="http://www.cftea.com/c/2010/12/UVBUCD0J888L2XPQ.asp">http://www.cftea.com/c/2010/12/UVBUCD0J888L2XPQ.asp</a>
</li>
</ol>

<p>
《
       .notice-td { overflow:hidden;white-space:nowrap;word-break:keep-all;  }
</p>
</div>
</div>

<div id="outline-container-sec-14" class="outline-2">
<h2 id="sec-14">autocompte</h2>
<div class="outline-text-2" id="text-14">
<p>
<a href="http://jqueryui.com/autocomplete/#multiple-remote">http://jqueryui.com/autocomplete/#multiple-remote</a>
</p>
</div>
</div>
<div id="outline-container-sec-15" class="outline-2">
<h2 id="sec-15">min js</h2>
<div class="outline-text-2" id="text-15">
<ul class="org-ul">
<li><a href="http://yui.github.io/yuicompressor/">http://yui.github.io/yuicompressor/</a>
</li>
<li><a href="https://github.com/yui/yuicompressor/releases">https://github.com/yui/yuicompressor/releases</a>
</li>
</ul>

<pre class="example">
java -jar yuicompressor-x.y.z.jar myfile.js -o myfile-min.js
java -jar /home/will/JD/tools/yuicompressor-2.4.8.jar  jquery.portlet.js -o  jquery.portlet.min.js

java -jar /home/will/JD/tools/yuicompressor-2.4.8.jar  jquery.portlet.js -o  jquery.portlet.pack.js
</pre>
</div>
</div>

<div id="outline-container-sec-16" class="outline-2">
<h2 id="sec-16">Node js</h2>
<div class="outline-text-2" id="text-16">
<ul class="org-ul">
<li><a href="http://www.nodebeginner.org/index-zh-cn.html">http://www.nodebeginner.org/index-zh-cn.html</a>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-17" class="outline-2">
<h2 id="sec-17"><a href="https://angularjs.org/">Angular</a> + meteor</h2>
<div class="outline-text-2" id="text-17">
<p>
通过阅读文章好像Angular更好一些
</p>

<ol class="org-ol">
<li><a href="http://www.csdn.net/article/2013-09-09/2816880-angular-ember-javascript-frameworks">http://www.csdn.net/article/2013-09-09/2816880-angular-ember-javascript-frameworks</a>
</li>
<li><a href="http://blog.jobbole.com/46779/">http://blog.jobbole.com/46779/</a>
</li>
<li><a href="http://zouyesheng.com/angular.html">http://zouyesheng.com/angular.html</a>
</li>
<li><a href="http://emberjs.com/">http://emberjs.com/</a>
</li>
<li><a href="http://www.cnblogs.com/rush/archive/2013/04/29/3051191.html">http://www.cnblogs.com/rush/archive/2013/04/29/3051191.html</a>
</li>
<li><a href="http://angularjs.org/">http://angularjs.org/</a>
</li>
<li><a href="http://developer.51cto.com/art/201308/406932_all.htm">http://developer.51cto.com/art/201308/406932_all.htm</a>
</li>
<li><a href="http://www.ng-newsletter.com/posts/beginner2expert-how_to_start.html">http://www.ng-newsletter.com/posts/beginner2expert-how_to_start.html</a>
</li>
<li><a href="http://docs.meteor.com/#livehtmltemplates">http://docs.meteor.com/#livehtmltemplates</a>
</li>
<li><a href="https://github.com/angular-ui/ui-sortable">https://github.com/angular-ui/ui-sortable</a>
</li>
<li><a href="http://angular-ui.github.io/ng-grid/">http://angular-ui.github.io/ng-grid/</a>
</li>
<li><a href="https://github.com/angular-ui/ng-grid">https://github.com/angular-ui/ng-grid</a>
</li>
<li><a href="https://github.com/JimLiu/angular-ui-tree">https://github.com/JimLiu/angular-ui-tree</a>
</li>
<li><a href="https://github.com/search?p=3&q=angular-ui&ref=cmdform&type=Repositories">https://github.com/search?p=3&q=angular-ui&ref=cmdform&type=Repositories</a>
</li>
<li><a href="http://angular-ui.github.io/bootstrap/">http://angular-ui.github.io/bootstrap/</a>
</li>
<li><a href="http://www.csdn.net/article/2013-03-14/2814486-Meteor-Web-App">http://www.csdn.net/article/2013-03-14/2814486-Meteor-Web-App</a>
</li>
<li><a href="http://angular-ui.github.io/">http://angular-ui.github.io/</a>
</li>
<li><a href="http://www.infoq.com/cn/news/2014/05/angularjs-front-end-architecture?utm_campaign=infoq_content&utm_source=infoq&utm_medium=feed&utm_term=global">基于AngularJS的企业软件前端架构</a>
</li>
</ol>

<p>
**Portal 
</p>
<ol class="org-ol">
<li><a href="https://github.com/nickholub/angular-ui-dashboard">https://github.com/nickholub/angular-ui-dashboard</a>
</li>
<li><a href="http://nickholub.github.io/angular-dashboard-app/#/">http://nickholub.github.io/angular-dashboard-app/#/</a>
</li>
<li><a href="https://github.com/flamejs/flame.js">https://github.com/flamejs/flame.js</a>
</li>
<li>JQuery UI - sortable 排序插件参数详解 <a href="http://www.cnblogs.com/yoyogehei/archive/2011/07/28/2119910.html">http://www.cnblogs.com/yoyogehei/archive/2011/07/28/2119910.html</a>
</li>
<li><a href="http://www.hongkiat.com/blog/jquery-ui-sortable/">http://www.hongkiat.com/blog/jquery-ui-sortable/</a>
</li>
<li>AngularJS入门教程 <a href="http://www.ituring.com.cn/minibook/303">http://www.ituring.com.cn/minibook/303</a>
</li>
<li><a href="http://blog.pusher.com/making-angular-js-realtime-with-pusher/">Making Angular.js realtime with Websockets</a>
</li>
</ol>
</div>
